Considerações:
 - Estou fazendo tudo com views para só no fim transformar em tabelas

### Conexão com a base de dados

In [2]:
############## Importar os módulos necessários para o Notebook:
import ipywidgets as widgets     #---
from sqlalchemy import create_engine

############## Conectar com um servidor SQL na base Alunos 15 ###################### --> Postgres.Alunos15
%load_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:pgadmin@localhost/airbnb2')
%sql postgresql://postgres:pgadmin@localhost/airbnb2

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## 1NF das tabelas

### Passo 1 - fazendo 1NF pra Listing

#### Extraindo o nome

In [7]:
%%sql
SELECT
    CASE WHEN POSITION(' · ' IN name)>0 THEN
        SPLIT_PART(name,' · ',1)
    ELSE
        NULL
    END AS nome 
    FROM Listings
    LIMIT 10

 * postgresql://postgres:***@localhost/airbnb2
10 rows affected.

[('Condo in Rio de Janeiro',),
 ('Rental unit in Rio de Janeiro',),
 ('Loft in Rio de Janeiro',),
 ('Rental unit in Rio de Janeiro',),
 ('Condo in Rio de Janeiro',),
 ('Home in Rio de Janeiro',),
 ('Rental unit in Rio de Janeiro',),
 ('Rental unit in Rio de Janeiro',),
 ('Rental unit in Ipanema',),
 ('Rental unit in Rio de Janeiro',)]

#### Extraindo as avaliações

In [8]:
%%sql
SELECT 
    CASE
        WHEN POSITION('★' IN name) > 0 THEN
            CAST(NULLIF(TRIM(
                CASE WHEN POSITION(' · ' IN SUBSTRING(name FROM POSITION('★' IN name)+1))>0 THEN
                    SUBSTRING(
                        SUBSTRING(name FROM POSITION('★' IN name)+1),
                        0,
                        POSITION(' · ' IN SUBSTRING(name FROM POSITION('★' IN name)))
                    )
                ELSE 
                    SUBSTRING(name FROM POSITION('★' IN name)+1)
                END
            ),'New') AS FLOAT)
        ELSE
            NULL
    END AS avaliacao
    FROM Listings
    LIMIT 10

 * postgresql://postgres:***@localhost/airbnb2
10 rows affected.

[(4.7,),
 (4.72,),
 (4.9,),
 (4.21,),
 (4.57,),
 (4.76,),
 (4.81,),
 (None,),
 (4.76,),
 (4.96,)]

#### Extraindo o Nquartos

In [9]:
%%sql
SELECT 
    CASE
        WHEN POSITION('bedroom' IN name) > 0 THEN
            CAST(TRIM(
                CASE WHEN POSITION(' · ' IN SUBSTRING(name,0,POSITION('bedroom' IN name)))>0 THEN
                    SUBSTRING(
                        SUBSTRING(name,0,POSITION('bedroom' IN name)),
                        LENGTH(SUBSTRING(name,0,POSITION('bedroom' IN name))) - POSITION(' · ' IN REVERSE(SUBSTRING(name,0,POSITION('bedroom' IN name)))) + 1,
                        LENGTH(SUBSTRING(name,0,POSITION('bedroom' IN name))) - 7
                    )
                ELSE 
                    SUBSTRING(name,0,POSITION('bedroom' IN name))
                END
            ) AS SMALLINT)
        ELSE
            0
    END AS Nquartos
    FROM Listings
    LIMIT 10

 * postgresql://postgres:***@localhost/airbnb2
10 rows affected.

[(2,), (1,), (1,), (2,), (1,), (7,), (2,), (1,), (6,), (1,)]

#### Extraindo o número de camas

In [10]:
%%sql
SELECT 
    CASE
        WHEN POSITION('beds' IN name) > 0 THEN
            CAST(TRIM(
                CASE WHEN POSITION(' · ' IN SUBSTRING(name,0,POSITION('beds' IN name)))>0 THEN
                    SUBSTRING(
                        SUBSTRING(name,0,POSITION('beds' IN name)),
                        LENGTH(SUBSTRING(name,0,POSITION('beds' IN name))) - POSITION(' · ' IN REVERSE(SUBSTRING(name,0,POSITION('beds' IN name)))) + 1,
                        LENGTH(SUBSTRING(name,0,POSITION('beds' IN name))) - 4
                    )
                ELSE 
                    SUBSTRING(name,0,POSITION('beds' IN name))
                END
            ) AS SMALLINT)
        WHEN POSITION('1 bed ' IN name) > 0 THEN
            1
        ELSE
            0
    END AS Ncamas
    FROM Listings
    LIMIT 10

 * postgresql://postgres:***@localhost/airbnb2
10 rows affected.

[(2,), (1,), (1,), (0,), (1,), (7,), (3,), (1,), (7,), (1,)]

#### Extraindo o número de banheiros (não importa o tipo)

In [ ]:
303587
449391

In [11]:
%%sql
SELECT 
    CASE
        WHEN POSITION('bath' IN name) > 0 THEN
            CAST(NULLIF(
                REGEXP_REPLACE(
                    SUBSTRING(
                        name, 
                        LENGTH(SUBSTRING(name,0,POSITION('bath' IN name))) - POSITION(' · ' IN REVERSE(SUBSTRING(name,0,POSITION('bath' IN name)))) + 1,
                        POSITION('bath' IN name)),
                '[^0-9.]','','g'
                ),'')
             AS FLOAT)
        ELSE
            0
    END AS Nbanheiros
    FROM Listings
        WHERE id = 449391
    LIMIT 10

 * postgresql://postgres:***@localhost/airbnb2
1 rows affected.

[(None,)]

#### Formatação completa pra Listings e guardando em uma View

 * postgresql://postgres:***@localhost/airbnb2
Done.
(psycopg2.errors.DuplicateColumn) column "text" specified more than once

[SQL: CREATE VIEW Listings_1NF AS
SELECT
    id AS listing_id,
    listing_url,
    scrape_id,
    last_scraped,
    source,
    CASE WHEN POSITION(' · ' IN name)>0 THEN
        SPLIT_PART(name,' · ',1)
    ELSE
        NULL
    END AS nome ,

    CASE
        WHEN POSITION('★' IN name) > 0 THEN
            CAST(NULLIF(TRIM(
                CASE WHEN POSITION(' · ' IN SUBSTRING(name FROM POSITION('★' IN name)+1))>0 THEN
                    SUBSTRING(
                        SUBSTRING(name FROM POSITION('★' IN name)+1),
                        0,
                        POSITION(' · ' IN SUBSTRING(name FROM POSITION('★' IN name)))
                    )
                ELSE
                    SUBSTRING(name FROM POSITION('★' IN name)+1)
                END
            ),'New') AS FLOAT)
        ELSE
            NULL
    END AS avaliacao,

    CASE
        WHEN POSITION('bedroom' IN name) > 0 THEN
            CAST(TRIM(
                CASE WHEN POSITION(' · ' IN SUBSTRING(name,0,POSITION('bedroom' IN name)))>0 THEN
                    SUBSTRING(
                        SUBSTRING(name,0,POSITION('bedroom' IN name)),
                        LENGTH(SUBSTRING(name,0,POSITION('bedroom' IN name))) - POSITION(' · ' IN REVERSE(SUBSTRING(name,0,POSITION('bedroom' IN name)))) + 1,
                        LENGTH(SUBSTRING(name,0,POSITION('bedroom' IN name))) - 7
                    )
                ELSE
                    SUBSTRING(name,0,POSITION('bedroom' IN name))
                END
            ) AS SMALLINT)
        ELSE
            0
    END AS Nquartos,

    CASE
        WHEN POSITION('beds' IN name) > 0 THEN
            CAST(TRIM(
                CASE WHEN POSITION(' · ' IN SUBSTRING(name,0,POSITION('beds' IN name)))>0 THEN
                    SUBSTRING(
                        SUBSTRING(name,0,POSITION('beds' IN name)),
                        LENGTH(SUBSTRING(name,0,POSITION('beds' IN name))) - POSITION(' · ' IN REVERSE(SUBSTRING(name,0,POSITION('beds' IN name)))) + 1,
                        LENGTH(SUBSTRING(name,0,POSITION('beds' IN name))) - 4
                    )
                ELSE
                    SUBSTRING(name,0,POSITION('beds' IN name))
                END
            ) AS SMALLINT)
        WHEN POSITION('1 bed ' IN name) > 0 THEN
            1
        ELSE
            0
    END AS Ncamas,

    CASE
        WHEN POSITION('bath' IN name) > 0 THEN
            CAST(NULLIF(
                REGEXP_REPLACE(
                    SUBSTRING(
                        name,
                        LENGTH(SUBSTRING(name,0,POSITION('bath' IN name))) - POSITION(' · ' IN REVERSE(SUBSTRING(name,0,POSITION('bath' IN name)))) + 1,
                        POSITION('bath' IN name)),
                '[^0-9.]','','g'
                ), '')
             AS FLOAT)
        ELSE
            0
    END AS Nbanheiros,

    description TEXT,
    neighborhood_overview TEXT,
    picture_url TEXT,
    host_id INTEGER,
    host_url TEXT,
    host_name TEXT,
    host_since DATE,
    host_location TEXT,
    host_about TEXT,
    host_response_time TEXT,
    host_response_rate TEXT,
    host_acceptance_rate TEXT,
    host_is_superhost BOOLEAN,
    host_thumbnail_url TEXT,
    host_picture_url TEXT,
    host_neighbourhood TEXT,
    host_listings_count TEXT,
    host_total_listings_count TEXT,
    host_verifications JSONB,
    host_has_profile_pic BOOLEAN,
    host_identity_verified BOOLEAN,
    neighbourhood TEXT,
    neighbourhood_cleansed TEXT,
    neighbourhood_group_cleansed TEXT,
    latitude NUMERIC,
    longitude NUMERIC,
    property_type TEXT,
    room_type TEXT,
    accommodates INTEGER,
    bathrooms NUMERIC,
    bathrooms_text TEXT,
    bedrooms INTEGER,
    beds INTEGER,
    amenities JSONB,
    price MONEY,
    minimum_nights INTEGER,
    maximum_nights INTEGER,
    minimum_minimum_nights INTEGER,
    maximum_minimum_nights INTEGER,
    minimum_maximum_nights INTEGER,
    maximum_maximum_nights INTEGER,
    minimum_nights_avg_ntm NUMERIC,
    maximum_nights_avg_ntm NUMERIC,
    calendar_updated DATE,
    has_availability BOOLEAN,
    availability_30 INTEGER,
    availability_60 INTEGER,
    availability_90 INTEGER,
    availability_365 INTEGER,
    calendar_last_scraped DATE,
    number_of_reviews INTEGER,
    number_of_reviews_ltm INTEGER,
    number_of_reviews_l30d INTEGER,
    first_review DATE,
    last_review DATE,
    review_scores_rating NUMERIC,
    review_scores_accuracy NUMERIC,
    review_scores_cleanliness NUMERIC,
    review_scores_checkin NUMERIC,
    review_scores_communication NUMERIC,
    review_scores_location NUMERIC,
    review_scores_value NUMERIC,
    license TEXT,
    instant_bookable BOOLEAN,
    calculated_host_listings_count INTEGER,
    calculated_host_listings_count_entire_homes INTEGER,
    calculated_host_listings_count_private_rooms INTEGER,
    reviews_per_month NUMERIC
FROM Listings;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [13]:
%%sql 
SELECT * FROM Listings_1NF LIMIT 50

 * postgresql://postgres:***@localhost/airbnb2
50 rows affected.

[(17878, 'Condo in Rio de Janeiro', 4.7, 2, 2, 1.0, 68997, 'Matthias', '$1,357.00', 5, 311, '2023-12-22', 1.9, 1, 269, 29, None),
 (25026, 'Rental unit in Rio de Janeiro', 4.72, 1, 1, 1.0, 102840, 'Viviane', '$865.00', 2, 275, '2023-12-03', 1.67, 1, 228, 29, None),
 (35764, 'Loft in Rio de Janeiro', 4.9, 1, 1, 1.5, 153691, 'Patricia Miranda & Paulo', '$373.00', 3, 454, '2023-12-17', 2.82, 1, 62, 36, None),
 (41198, 'Rental unit in Rio de Janeiro', 4.21, 2, 0, 1.0, 178975, 'Nicky', '$1,701.00', 3, 17, '2016-02-09', 0.13, 2, 44, 0, None),
 (326205, 'Condo in Rio de Janeiro', 4.57, 1, 1, 1.0, 1603206, 'Bob', '$366.00', 3, 152, '2023-11-21', 1.07, 5, 293, 14, None),
 (332151, 'Home in Rio de Janeiro', 4.76, 7, 7, 5.0, 406989, 'Casa 48 Guesthouse', '$169.00', 1, 42, '2023-10-30', 0.34, 5, 262, 4, None),
 (326575, 'Rental unit in Rio de Janeiro', 4.81, 2, 3, 2.0, 1668565, 'Maria José', '$368.00', 4, 227, '2023-11-21', 1.58, 1, 245, 12, None),
 (216461, 'Rental unit in Rio de Janeiro', None, 1, 1, 1.0, 1154263, 'Zeilma , Da', '$734.00', 1, 0, None, None, 1, 365, 0, None),
 (48305, 'Rental unit in Ipanema', 4.76, 6, 7, 7.0, 70933, 'Goitaca', '$6,604.00', 2, 163, '2023-12-10', 1.04, 10, 319, 36, None),
 (216700, 'Rental unit in Rio de Janeiro', 4.96, 1, 1, 1.0, 1118486, 'Moara', '$300.00', 3, 24, '2023-11-05', 0.17, 2, 356, 3, None),
 (219250, 'Loft in Rio de Janeiro', 4.82, 1, 2, 1.0, 1134264, 'Ricardo', '$254.00', 2, 431, '2023-12-11', 3.07, 2, 312, 25, None),
 (548170, 'Home in Rio de Janeiro', None, 1, 1, 1.0, 2694627, 'Ricardo', '$200.00', 1, 0, None, None, 4, 0, 0, None),
 (48901, 'Rental unit in Rio', 4.5, 4, 5, 3.0, 222884, 'Marcio', '$2,566.00', 3, 24, '2023-12-11', 0.23, 1, 308, 16, None),
 (220377, 'Rental unit in Rio de Janeiro', 5.0, 1, 1, 1.0, 1142424, 'Taciana', '$220.00', 1, 4, '2017-04-06', 0.03, 4, 294, 0, None),
 (220705, 'Rental unit in Rio de Janeiro', None, 1, 2, 2.5, 1144461, 'Rachel', '$300.00', 3, 0, None, None, 2, 0, 0, None),
 (327375, 'Rental unit in Rio de Janeiro', 4.0, 6, 16, 5.0, 1673501, 'Josy', '$5,874.00', 3, 12, '2020-02-25', 0.09, 1, 365, 0, None),
 (49179, 'Rental unit in Rio de Janeiro', 4.82, 1, 1, 1.0, 224192, 'David', '$409.00', 4, 156, '2023-12-19', 1.15, 18, 0, 28, None),
 (231497, 'Rental unit in Rio de Janeiro', 4.74, 1, 1, 1.0, 1207700, 'Maria Luiza', '$500.00', 3, 82, '2023-11-21', 0.56, 3, 234, 13, None),
 (328626, 'Rental unit in Rio de Janeiro', None, 2, 5, 3.0, 1675497, 'Priscila', '$1,250.00', 20, 1, '2012-02-21', 0.01, 1, 365, 0, None),
 (223073, 'Loft in Rio de Janeiro', 4.81, 1, 1, 1.0, 503995, '❤️ BrUx ❤️', '$779.00', 1, 463, '2023-12-20', 3.11, 7, 338, 26, None),
 (50759, 'Home in Rio de Janeiro', 4.57, 6, 10, 7.0, 233554, 'Felipe', '$3,500.00', 1, 7, '2017-01-08', 0.07, 2, 356, 0, None),
 (230989, 'Rental unit in Rio de Janeiro', 4.63, 1, 1, 1.0, 1207700, 'Maria Luiza', '$500.00', 3, 153, '2023-12-04', 1.03, 3, 1, 23, None),
 (231105, 'Rental unit in Rio de Janeiro', 4.86, 1, 1, 1.0, 1208327, 'Christian', '$437.00', 3, 111, '2023-12-12', 0.89, 8, 73, 13, None),
 (329615, 'Home in Rio de Janeiro', None, 1, 1, 1.0, 1416853, 'Maria', '$972.00', 1, 0, None, None, 1, 0, 0, None),
 (51703, 'Rental unit in Rio de Janeiro', 4.76, 0, 1, 1.0, 238091, 'Dália', '$794.00', 3, 257, '2023-11-22', 1.85, 2, 306, 31, None),
 (330913, 'Rental unit in Rio de Janeiro', 4.78, 1, 2, 1.0, 500892, 'Rafael', None, 4, 12, '2013-07-21', 0.08, 6, 0, 0, None),
 (331088, 'Rental unit in Rio de Janeiro', 4.51, 1, 1, 1.0, 530231, 'Yaya', '$105.00', 1, 53, '2023-10-29', 0.37, 6, 271, 4, None),
 (53533, 'Home in Joatinga', 4.95, 4, 6, 4.0, 249439, 'Sherri & Andre', '$2,893.00', 3, 37, '2023-11-12', 0.25, 1, 363, 10, None),
 (332150, 'Home in Santa Teresa', 4.78, 1, 7, 5.0, 406989, 'Casa 48 Guesthouse', '$186.00', 1, 78, '2023-11-03', 0.57, 5, 287, 8, None),
 (236991, 'Rental unit in Rio de Janeiro', 4.89, 1, 4, 1.0, 1241662, 'Nilda', '$1,074.00', 5, 84, '2023-12-22', 0.7, 2, 67, 27, None),
 (60718, 'Rental unit in Rio de Janeiro', 4.8, 4, 4, 2.0, 292870, 'Tânia', '$1,300.00', 6, 11, '2023-11-24', 0.07, 1, 330, 3, None),
 (238802, 'Rental unit in Rio', 4.79, 3, 4, 2.0, 235496, 'Paola', '$1,083.00', 2, 106, '2023-11-27', 0.72, 4, 0, 34, None),
 (333305, 'Rental unit in Rio de Janeiro', 4.25, 1, 2, 1.0, 1698297, 'Rodrigo', '$2,348.00', 2, 4, '2016-08-24', 0.04, 1, 363, 0, None),
 (336502, 'Rental unit in Rio de Janeiro', 4.82, 1, 3, 1.0, 241334, 'Andrea', '$793.00', 4, 24, '2023-12-14', 0.17, 4, 215, 22, None),
 (337345, 'Rental unit in Rio de Janeiro', None, 1, 2, 1.0, 1714680, 'Katiuscia', '$2,411.00', 1, 0, None, None, 1, 365, 0, None),
 (64795, 'Rental unit in Rio de Janeiro', 4.73, 3, 4, 2.5, 93005, 'Andrea', '$1,600.00', 3, 70, '2023-11-22', 0.45, 1, 0, 22, None),
 (340432, 'Rental unit in Rio de Janeiro', 4.83, 1, 4, 1.0, 1450861, 'Leila', '$680.00', 5, 236, '2023-12-13', 1.66, 4, 100, 29, None),
 (239531, 'Rental unit in Rio de Janeiro', 4.59, 1, 2, 1.0, 792218, 'Levy', '$877.00', 2, 113, '2023-11-20', 0.77, 10, 264, 16, None),
 (65546, 'Rental unit in Rio de Janeiro', 4.4, 3, 7, 7.0, 70933, 'Goitaca', '$6,500.00', 2, 69, '2023-07-13', 0.44, 10, 319, 1, None),
 (2693631, 'Rental unit in Rio de Janeiro', None, 1, 1, 1.0, 13785748, 'Fausto', '$2,576.00', 20, 0, None, None, 1, 0, 0, None),
 (245951, 'Rental unit in Rio de Janeiro', 4.88, 1, 2, 1.0, 1289982, 'Carnaval Turismo', '$443.00', 3, 16, '2023-11-12', 0.11, 1, 80, 3, None),
 (342874, 'Rental unit in Rio de Janeiro', 4.92, 1, 2, 1.0, 829630, 'Luciana', '$497.00', 1, 182, '2023-12-04', 1.27, 3, 76, 31, None),
 (66797, 'Rental unit in Rio', 4.91, 0, 1, 1.0, 328096, 'Carlos', '$696.00', 3, 293, '2023-12-04', 1.88, 2, 143, 36, None),
 (346694, 'Rental unit in Rio de Janeiro', None, 1, 1, 1.0, 1612576, 'Jassanan', '$313.00', 1, 0, None, None, 1, 362, 0, None),
 (247052, 'Rental unit in Rio de Janeiro', None, 2, 2, 3.0, 1295841, 'Osmar', '$734.00', 5, 0, None, None, 1, 3, 0, None),
 (70080, 'Rental unit in Rio', 4.8, 1, 5, 2.0, 319672, 'Valeria', '$1,293.00', 2, 555, '2023-12-23', 3.8, 5, 0, 65, None),
 (347295, 'Condo in Rio de Janeiro', 4.19, 1, 1, 1.0, 1603206, 'Bob', '$379.00', 3, 74, '2023-07-03', 0.52, 5, 31, 4, None),
 (70547, 'Townhouse in Rio de Janeiro', 4.92, 1, 1, 1.5, 357995, 'Isa & Paolo', '$184.00', 3, 89, '2023-12-14', 0.57, 2, 249, 6, None),
 (347820, 'Rental unit in Rio de Janeiro', 4.86, 3, 4, 2.0, 235496, 'Paola', '$981.00', 2, 351, '2023-11-13', 2.44, 4, 321, 31, None),
 (247779, 'Rental unit in Rio de Janeiro', 4.76, 1, 1, 1.0, 1298591, 'Karina', '$543.00', 2, 154, '2023-12-04', 1.05, 2, 16, 15, None)]

### Passo 2 - Fazendo 1NF pra Calendar

In [67]:
%%sql
SELECT * FROM Calendar LIMIT 10

 * postgresql://postgres:***@localhost/airbnb2
(psycopg2.errors.UndefinedTable) relation "calendar" does not exist
LINE 1: SELECT * FROM Calendar LIMIT 10
                      ^

[SQL: SELECT * FROM Calendar LIMIT 10]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [68]:
%%sql
ALTER TABLE Calendar RENAME TO Calendar_1NF;

 * postgresql://postgres:***@localhost/airbnb2
(psycopg2.errors.UndefinedTable) relation "calendar" does not exist

[SQL: ALTER TABLE Calendar RENAME TO Calendar_1NF;]
(Background on this error at: https://sqlalche.me/e/20/f405)

### Passo 3 - Fazendo 1NF pra Reviews

In [69]:
%%sql
SELECT * FROM Reviews LIMIT 3

 * postgresql://postgres:***@localhost/airbnb2
(psycopg2.errors.UndefinedTable) relation "reviews" does not exist
LINE 1: SELECT * FROM Reviews LIMIT 3
                      ^

[SQL: SELECT * FROM Reviews LIMIT 3]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [70]:
%%sql
ALTER TABLE Reviews RENAME TO Reviews_1NF;
ALTER TABLE Reviews_1NF RENAME COLUMN id TO id_review;

 * postgresql://postgres:***@localhost/airbnb2
(psycopg2.errors.UndefinedTable) relation "reviews" does not exist

[SQL: ALTER TABLE Reviews RENAME TO Reviews_1NF;]
(Background on this error at: https://sqlalche.me/e/20/f405)

## 2NF das tabelas

### 2NF da tabela Listing 1NF (já está em 2NF)

In [110]:
%sql SELECT * FROM Listings_1NF LIMIT 3

 * postgresql://postgres:***@localhost/airbnb2
3 rows affected.

[(Decimal('17878'), 'Condo in Rio de Janeiro', 4.7, 2, 2, 1.0, Decimal('68997'), 'Matthias', Decimal('1357.0'), Decimal('5'), Decimal('311'), datetime.date(2023, 12, 22), 1.9, Decimal('1'), Decimal('269'), Decimal('29'), 'NaN'),
 (Decimal('216461'), 'Rental unit in Rio de Janeiro', None, 1, 1, 1.0, Decimal('1154263'), 'Zeilma , Da', Decimal('734.0'), Decimal('1'), Decimal('0'), None, nan, Decimal('1'), Decimal('365'), Decimal('0'), 'NaN'),
 (Decimal('326205'), 'Condo in Rio de Janeiro', 4.57, 1, 1, 1.0, Decimal('1603206'), 'Bob', Decimal('366.0'), Decimal('3'), Decimal('152'), datetime.date(2023, 11, 21), 1.07, Decimal('5'), Decimal('293'), Decimal('14'), 'NaN')]

In [114]:
%%sql
ALTER TABLE Listings_1NF RENAME TO Listings_2NF;

 * postgresql://postgres:***@localhost/airbnb2
Done.
Done.

[]

### 2NF da Calendar (já está em 2NF)

In [73]:
%%sql
SELECT * FROM Calendar_1NF LIMIT 4

 * postgresql://postgres:***@localhost/airbnb2
(psycopg2.errors.UndefinedTable) relation "calendar_1nf" does not exist
LINE 1: SELECT * FROM Calendar_1NF LIMIT 4
                      ^

[SQL: SELECT * FROM Calendar_1NF LIMIT 4]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [74]:
%%sql

ALTER TABLE Calendar_1NF RENAME TO Calendar_2NF;

 * postgresql://postgres:***@localhost/airbnb2
(psycopg2.errors.UndefinedTable) relation "calendar_1nf" does not exist

[SQL: ALTER TABLE Calendar_1NF RENAME TO Calendar_2NF;]
(Background on this error at: https://sqlalche.me/e/20/f405)

### 2NF da Reviews (já está em 2NF)

In [75]:
%%sql
SELECT * FROM Reviews_1NF LIMIT 4

 * postgresql://postgres:***@localhost/airbnb2
(psycopg2.errors.UndefinedTable) relation "reviews_1nf" does not exist
LINE 1: SELECT * FROM Reviews_1NF LIMIT 4
                      ^

[SQL: SELECT * FROM Reviews_1NF LIMIT 4]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [76]:
%%sql
ALTER TABLE Reviews_1NF RENAME TO Reviews_2NF;

 * postgresql://postgres:***@localhost/airbnb2
(psycopg2.errors.UndefinedTable) relation "reviews_1nf" does not exist

[SQL: ALTER TABLE Reviews_1NF RENAME TO Reviews_2NF;]
(Background on this error at: https://sqlalche.me/e/20/f405)

## 3NF das tabelas

### 3NF Listings

In [6]:
%%sql
SELECT * FROM Listings_2NF
 LIMIT 10

 * postgresql://postgres:***@localhost/airbnb2
10 rows affected.

[(Decimal('17878'), 'Condo in Rio de Janeiro', 4.7, 2, 2, 1.0, Decimal('68997'), 'Matthias', Decimal('1357.0'), Decimal('5'), Decimal('311'), datetime.date(2023, 12, 22), 1.9, Decimal('1'), Decimal('269'), Decimal('29'), 'NaN'),
 (Decimal('216461'), 'Rental unit in Rio de Janeiro', None, 1, 1, 1.0, Decimal('1154263'), 'Zeilma , Da', Decimal('734.0'), Decimal('1'), Decimal('0'), None, nan, Decimal('1'), Decimal('365'), Decimal('0'), 'NaN'),
 (Decimal('326205'), 'Condo in Rio de Janeiro', 4.57, 1, 1, 1.0, Decimal('1603206'), 'Bob', Decimal('366.0'), Decimal('3'), Decimal('152'), datetime.date(2023, 11, 21), 1.07, Decimal('5'), Decimal('293'), Decimal('14'), 'NaN'),
 (Decimal('25026'), 'Rental unit in Rio de Janeiro', 4.72, 1, 1, 1.0, Decimal('102840'), 'Viviane', Decimal('865.0'), Decimal('2'), Decimal('275'), datetime.date(2023, 12, 3), 1.67, Decimal('1'), Decimal('228'), Decimal('29'), 'NaN'),
 (Decimal('326575'), 'Rental unit in Rio de Janeiro', 4.81, 2, 3, 2.0, Decimal('1668565'), 'Maria José', Decimal('368.0'), Decimal('4'), Decimal('227'), datetime.date(2023, 11, 21), 1.58, Decimal('1'), Decimal('245'), Decimal('12'), 'NaN'),
 (Decimal('216700'), 'Rental unit in Rio de Janeiro', 4.96, 1, 1, 1.0, Decimal('1118486'), 'Moara', Decimal('300.0'), Decimal('3'), Decimal('24'), datetime.date(2023, 11, 5), 0.17, Decimal('2'), Decimal('356'), Decimal('3'), 'NaN'),
 (Decimal('219250'), 'Loft in Rio de Janeiro', 4.82, 1, 2, 1.0, Decimal('1134264'), 'Ricardo', Decimal('254.0'), Decimal('2'), Decimal('431'), datetime.date(2023, 12, 11), 3.07, Decimal('2'), Decimal('312'), Decimal('25'), 'NaN'),
 (Decimal('35764'), 'Loft in Rio de Janeiro', 4.9, 1, 1, 1.5, Decimal('153691'), 'Patricia Miranda & Paulo', Decimal('373.0'), Decimal('3'), Decimal('454'), datetime.date(2023, 12, 17), 2.82, Decimal('1'), Decimal('62'), Decimal('36'), 'NaN'),
 (Decimal('220377'), 'Rental unit in Rio de Janeiro', 5.0, 1, 1, 1.0, Decimal('1142424'), 'Taciana', Decimal('220.0'), Decimal('1'), Decimal('4'), datetime.date(2017, 4, 6), 0.03, Decimal('4'), Decimal('294'), Decimal('0'), 'NaN'),
 (Decimal('327375'), 'Rental unit in Rio de Janeiro', 4.0, 6, 16, 5.0, Decimal('1673501'), 'Josy', Decimal('5874.0'), Decimal('3'), Decimal('12'), datetime.date(2020, 2, 25), 0.09, Decimal('1'), Decimal('365'), Decimal('0'), 'NaN')]

In [12]:
%%sql
DROP VIEW IF EXISTS Host_3NF CASCADE;
CREATE VIEW Host_3NF AS
    SELECT DISTINCT host_id, host_name, calculated_host_listings_count
        
    FROM Listings_2NF;

DROP VIEW IF EXISTS Listings_3NF CASCADE;
CREATE VIEW Listings_3NF AS
    SELECT listing_id, nome, avaliacao, nquartos, ncamas, 
           nbanheiros, host_id, price, minimum_nights, number_of_reviews, 
           last_review, reviews_per_month, availability_365, 
           number_of_reviews_ltm, license
    FROM Listings_2NF;

 * postgresql://postgres:***@localhost/airbnb2
Done.
Done.
Done.
Done.

[]

### 3NF Calendar

In [8]:
%%sql
SELECT * FROM Calendar_2NF LIMIT 3

 * postgresql://postgres:***@localhost/airbnb2
(psycopg2.errors.UndefinedTable) relation "calendar_2nf" does not exist
LINE 1: SELECT * FROM Calendar_2NF LIMIT 3
                      ^

[SQL: SELECT * FROM Calendar_2NF LIMIT 3]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [9]:
%%sql
ALTER TABLE Calendar_2NF RENAME TO Calendar_3NF;

 * postgresql://postgres:***@localhost/airbnb2
(psycopg2.errors.UndefinedTable) relation "calendar_2nf" does not exist

[SQL: ALTER TABLE Calendar_2NF RENAME TO Calendar_3NF;]
(Background on this error at: https://sqlalche.me/e/20/f405)

### 3NF Reviews

In [10]:
%%sql 
SELECT * FROM Reviews_2NF LIMIT 3

 * postgresql://postgres:***@localhost/airbnb2
3 rows affected.

[(Decimal('17878'), Decimal('64852'), datetime.date(2010, 7, 15), Decimal('135370'), 'Tia', 'This apartment is in a perfect location -- two blocks from the beach and two blocks from the Copacabana Palace (where anyone famous stays when they a ... (99 characters truncated) ... e apartment is like, so you´ll have no surprises.  Max is very communicative and helpful.  The four of us that stayed here would highly recommend it.'),
 (Decimal('216700'), Decimal('1511171'), datetime.date(2012, 6, 18), Decimal('2598011'), 'Evelyn', 'A estada foi maravilhosa, ficamos so 3 noites se pudessemos ficariamos mais... mas com certeza voltaremos...o lugar eh maravilhoso, quando chegamos f ... (572 characters truncated) ...  sem duvida recomendamos a hospedagem... Saimos bem contentes e satisfeitos do rio e ja estamos planejando a volta....  Nao percam a oportunidade!!! '),
 (Decimal('216700'), Decimal('1550596'), datetime.date(2012, 6, 24), Decimal('2465739'), 'Camila', "The apartment is located in the beautiful Laranjeiras neighborhood,  everything there is easy access. There' re bakeries, markets, banks, restaurants ... (862 characters truncated) ... me e bem comfortavel com uma linda sacada. \r<br/>\r<br/>Foi uma pena passarmos somente um dia na casa de Moara. Com certeza, voltaremos na sua casa.")]

In [11]:
%%sql

DROP TABLE IF EXISTS Reviews_3NF CASCADE;
CREATE TABLE Reviews_3NF AS
    SELECT listing_id, id_review, date, reviewer_id, comments
    FROM Reviews_2NF;
    
DROP TABLE IF EXISTS Reviewers_3NF CASCADE;
CREATE TABLE Reviewers_3NF AS
    SELECT reviewer_id, reviewer_name
    FROM Reviews_2NF

 * postgresql://postgres:***@localhost/airbnb2
(psycopg2.errors.WrongObjectType) "reviews_3nf" is not a table
HINT:  Use DROP VIEW to remove a view.

[SQL: DROP TABLE IF EXISTS Reviews_3NF CASCADE;]
(Background on this error at: https://sqlalche.me/e/20/f405)

## BCNF das tabelas
Todas as tabelas já estão em BCNF, mas vou transformar elas em TABLES para ficar mais fácil. Isso inclui transformar o price do Calendar em float

In [122]:
%%sql
DROP TABLE IF EXISTS Listings_final CASCADE;
CREATE TABLE Listings_final (
    listing_id NUMERIC PRIMARY KEY,
    nome VARCHAR(255),
    avaliacao DOUBLE PRECISION,
    nquartos NUMERIC,
    ncamas NUMERIC,
    nbanheiros FLOAT,
    host_id NUMERIC,
    price FLOAT,
    minimum_nights NUMERIC,
    number_of_reviews NUMERIC,
    last_review Date,
    reviews_per_month FLOAT,
    availability_365 NUMERIC,
    number_of_reviews_ltm NUMERIC,
    license VARCHAR(255)
);

INSERT INTO Listings_final
SELECT 
    listing_id,
    nome,
    avaliacao,
    nquartos,
    ncamas,
    nbanheiros,
    host_id,
    price,
    minimum_nights,
    number_of_reviews,
    last_review,
    reviews_per_month,
    availability_365,
    number_of_reviews_ltm,
    license
FROM Listings_3NF;

 * postgresql://postgres:***@localhost/airbnb2
Done.
Done.
36008 rows affected.

[]

In [13]:
%%sql
DROP TABLE IF EXISTS Host_final CASCADE;
CREATE TABLE Host_final (
    host_id NUMERIC PRIMARY KEY,
    host_name VARCHAR(255),
    calculated_host_listings_count INTEGER
);

INSERT INTO Host_final
SELECT 
    host_id,
    host_name,
    calculated_host_listings_count
FROM Host_3NF;

 * postgresql://postgres:***@localhost/airbnb2
Done.
Done.
21980 rows affected.

[]

In [23]:
%%sql
DROP TABLE IF EXISTS Calendar_final CASCADE;
CREATE TABLE Calendar_final (
    calendar_id NUMERIC PRIMARY KEY,
    listing_id NUMERIC,
    date DATE,
    available CHAR,
    price FLOAT,
    adjusted_price FLOAT,
    minimum_nights FLOAT,
    maximum_nights FLOAT
);

INSERT INTO Calendar_final
SELECT 
    calendar_id,
    listing_id,
    date,
    available,
    CAST(NULLIF(REGEXP_REPLACE(price,'[^0-9.]','','g'),'') AS FLOAT),
    CAST(NULLIF(REGEXP_REPLACE(adjusted_price,'[^0-9.]','','g'),'') AS FLOAT),
    minimum_nights,
    maximum_nights
FROM Calendar_3NF;

 * postgresql://postgres:***@localhost/airbnb2
Done.
Done.
13145595 rows affected.

[]

In [29]:
%%sql
DROP TABLE IF EXISTS Reviews_final CASCADE;
CREATE TABLE Reviews_final (
    id_review NUMERIC PRIMARY KEY,
    listing_id NUMERIC,
    date DATE,
    reviewer_id NUMERIC,
    comments TEXT
);

INSERT INTO Reviews_final
SELECT 
    id_review,
    listing_id,
    date,
    reviewer_id,
    comments 
FROM Reviews_3NF;

 * postgresql://postgres:***@localhost/airbnb2
Done.
Done.

703796 rows affected.

[]